# IFC_ExportWithUI

## Description
Exports IFC file, showing Export IFC Project dialog

```pascal
PROCEDURE IFC_ExportWithUI(bExpSingleObj : BOOLEAN);
```

```python

def vs.IFC_ExportWithUI(bExpSingleObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bExpSingleObj|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* IFC